Есть квадратный город, в котором работает робот-курьер. Город размечен как сетка из клеток. Каждая клетка (район) кодируется числом:

0
0 — пустая;

−
1
−1 — недоступна для робота;

натуральное число — ценность посылки в этом районе;

−
2
−2, 
−
3
−3, ... — уникальный идентификатор станции метро, в этих клетках нет посылок.

Сеть метро задаётся списком соединений станций метро 
(
i
d
1
,
i
d
2
)
(id 
1
​
 ,id 
2
​
 ). Станции объединяются в ветки метро. Ветка метро — это множество станций, между которыми существует путь по списку соединений. Робот может двигаться по этим веткам по определённым правилам (описаны ниже).

Робот реализует два маршрута: прямой — из точки 
(
0
,
0
)
(0,0) в точку 
(
n
−
1
,
n
−
1
)
(n−1,n−1) и обратный. Посещая клетку района, он забирает в ней посылку. Посылка забирается из клетки один раз.

Чтобы не создавать хаос, робот передвигается по следующим правилам:

прямой маршрут: может идти вправо 
(
i
,
j
+
1
)
(i,j+1) и вниз 
(
i
+
1
,
j
)
(i+1,j), а также осуществлять переход от станции метро 
i
d
1
id 
1
​
  к станции 
i
d
2
id 
2
​
 , если они на одной ветке метро и каждая из координат 
i
d
1
id 
1
​
  не больше соответствующей координаты 
i
d
2
id 
2
​
 : 
(
i
1
≤
i
2
,
j
1
≤
j
2
)
(i 
1
​
 ≤i 
2
​
 ,j 
1
​
 ≤j 
2
​
 );

обратный маршрут: может идти влево 
(
i
,
j
−
1
)
(i,j−1) и вверх 
(
i
−
1
,
j
)
(i−1,j), а также осуществлять переход от станции метро 
i
d
1
id 
1
​
  к станции 
i
d
2
id 
2
​
 , если они на одной ветке метро и каждая из координат 
i
d
1
id 
1
​
  не меньше соответствующей координаты 
i
d
2
id 
2
​
 : 
(
i
1
≥
i
2
,
j
1
≥
j
2
)
(i 
1
​
 ≥i 
2
​
 ,j 
1
​
 ≥j 
2
​
 ).

Требуется вычислить максимальную суммарную ценность, которую робот может собрать, совершив две поездки: сначала по прямому маршруту, затем по обратному. Если прямой или обратный маршрут осуществить невозможно, следует вывести 0.

Формат ввода
В первой строке 
n
n — размер стороны квадрата, описывающего город (
1
≤
n
≤
500
1≤n≤500).

В 
n
n строках идёт по 
n
n чисел — коды каждого района / клетки (числа по модулю не превышают 
1
0
9
10 
9
 ).

В следующей строке 
m
m — количество связей в метро (
0
≤
m
≤
1000
0≤m≤1000).

В следующих строках 
m
m связей — гарантируется, что связи могут существовать (указаны корректные 
i
d
id).

Формат вывода
В единственной строке выведите одно целое число — максимальную суммарную ценность или 0, если прямой или обратный маршрут невозможен.

Пример 1
Ввод

4
0 3 4 -2
0 -1 -1 -1
-4 6 7 -3
0 0 0 2
2
-2 -3
-3 -4
Вывод

22
Пример 2
Ввод

4
0 3 4 -1
0 0 0 0
-1 6 7 0
0 0 0 2
0
Вывод

22
Пример 3
Ввод

4
0 3 4 -1
-1 -1 -1 -1
-1 6 7 0
0 0 0 2
0